
/*- Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить,
    до якої четверті години попадає число (в першу, другу, третю або четверту частину години).*/

/*let time = +prompt('введіть хвилину від 0 до 59');
    if (time >= 0 && time <= 14) {
    console.log('перша чверть')
    }
    else if (time >= 15 && time <= 29) {
    console.log('друга чверть')
    }
    else if (time >= 30 && time <=44) {
        console.log('третя чверть')
    }
    else if (time >= 45 && time <=59) {
        console.log('четверта четверть')
    }
    else {
        console.log('некоректно введені дані')
    }*/






/*- У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду)
місяця потрапляє це число (у першу, другу чи третю).*/

/*
let days = +prompt('введіть день від 1 до 31');
if (days >= 1 && days <= 10) {
    console.log('перша декада')
}
else if (days >= 11 && days <= 20) {
    console.log('друга декада')
}
else if (days >= 21 && days <= 31) {
    console.log('третя декада')
}
else {
    console.log('некоректно введені дані')
}
*/







// - У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти
// скрипта - з коротким записом(тернаркою)

/*let test1
if (confirm('?')) {
    test1 = 'вірно'
}
else {
    test1 = 'невірно'
}
console.log(test1)*/

/*let test2 = confirm('?') ? 'вірно' : 'невірно'
console.log(test2)*/

/*let test3 = prompt('введіть текст')
console.log(test3)*/









// - Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'.
//     Перевірте  скрипт при a, що дорівнює 1, 0, -3

/*let a = +prompt('введіть число 1, 0, -3')
if (a !== 0) {
    console.log('вірно')
}
else {
    console.log('невірно')
}*/








// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер
//     дня тижня і на екрані відображається інфа що заплановано на цей день.

/*let dayOfWeeks = +prompt('введіть день тижня від 1 до 7')
switch (dayOfWeeks) {
    case 1:
        console.log('понеділок - спорт')
        break
    case 2:
        console.log('вівторок - відпочинок')
        break
    case 3:
        console.log('середа - читання')
        break
    case 4:
        console.log('четвер - поїхати до батьків')
        break
    case 5:
        console.log('пятниця - помити авто')
        break
    case 6:
        console.log('субота - вихідний')
    case 7:
        console.log('неділя - вихідний')
        break
}*/







// - Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.

/*let year = +prompt('введіть кількість днів в цьому році')
if (year % 4 === 0) {
    console.log('рік високосний')
} else  {
    console.log('ура! наш рік нормальний')
}*/

/*(+prompt('введіть кількість днів в цьому році') % 4 === 0) ? console.log('рік високосний') :
    console.log('ура! наш рік нормальний')*/







/*- Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна»
    назва JavaScript?“. Якщо користувач вводить «ECMAScript», то показати: «Правильно!»,
    інакше – відобразити: «Не знаєте? ECMAScript!*/

let oficialName = prompt('яка офіційна назва JavaScript?')
if (oficialName === 'ECMAScript') {
    alert('правильно, гарна робота')
} else {
    alert('неправильно, офіційна назва ECMAScript!')
}
